class USER_1:
    first_name = 'Антон'
    last_name = 'Чувайз'
    delivery_address = 'Москва, Малая Сухаревская площадь, 12'
    metro_station = 'Сокольники'
    phone_number = '+79993330999'
    delivery_date = '26.11.2025'
    rental_period = 'сутки'
    scooter_color = 'black'
    comment = 'Позвонить за час'


class USER_2:
    first_name = 'Юрий'
    last_name = 'Тугарин'
    delivery_address = 'Санкт-Петербург, Кантемировская улица, 10'
    metro_station = 'Лубянка'
    phone_number = '+79212347700'
    delivery_date = '27.11.2025'
    rental_period = 'двое суток'
    scooter_color = 'grey'
    comment = 'Оставить у дома'


class FAQ:
    QUESTION_DATA = [
        "Сутки — 400 рублей. Оплата курьеру — наличными или картой.",
        "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.",
        "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",
        "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",
        "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.",
        "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.",
        "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.",
        "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    ]
